OpenNuvoton/M55M1BSP/Library/StdDriver/src/utcpd.c
/**************************************************************************//**
 * @file     utcpd.c
 * @version  V1.00
 * @brief    UTCPD driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#include "NuMicro.h"
#include "utcpdlib.h"

#ifdef __cplusplus
extern "C"
{
#endif

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup UTCPD_Driver UTCPD Driver
  @{
*/

/** @addtogroup UTCPD_EXPORTED_FUNCTIONS UTCPD Exported Functions
  @{
*/


/**
  * @brief      Get UTCPD Alert Status
  *
  * @param[in]  port            Specify UTCPD port
  * @param[in]  i32AlertSts     Alert status point
  *             - \ref UTCPD_ALERT_CCSCHIS
  *             - \ref UTCPD_ALERT_PWRSCHIS
  *             - \ref UTCPD_ALERT_RXSOPIS
  *             - \ref UTCPD_ALERT_RXHRSTIS
  *             - \ref UTCPD_ALERT_TXFAILIS
  *             - \ref UTCPD_ALERT_TXDCUIS
  *             - \ref UTCPD_ALERT_TXOKIS
  *             - \ref UTCPD_ALERT_VBAMHIS
  *             - \ref UTCPD_ALERT_VBAMLIS
  *             - \ref UTCPD_ALERT_FUTIS
  *             - \ref UTCPD_ALERT_RXOFIS
  *             - \ref UTCPD_ALERT_SKDCDTIS
  *             - \ref UTCPD_ALERT_VNDIS
  * @return     0: Successful,  1: Fail
  *
  * @details    Get the  Alert Status flag
  *
  */
int32_t UTCPD_GetAlertStatus(int port, int *i32AlertSts)
{
    return tcpc_addr_read16(port, 0, TCPC_REG_ALERT, i32AlertSts);
}

/**
  * @brief      Clear UTCPD Alert Status
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  AlertStClr     Alert status clear
  *             - \ref UTCPD_ALERT_CCSCHIS
  *             - \ref UTCPD_ALERT_PWRSCHIS
  *             - \ref UTCPD_ALERT_RXSOPIS
  *             - \ref UTCPD_ALERT_RXHRSTIS
  *             - \ref UTCPD_ALERT_TXFAILIS
  *             - \ref UTCPD_ALERT_TXDCUIS
  *             - \ref UTCPD_ALERT_TXOKIS
  *             - \ref UTCPD_ALERT_VBAMHIS
  *             - \ref UTCPD_ALERT_VBAMLIS
  *             - \ref UTCPD_ALERT_FUTIS
  *             - \ref UTCPD_ALERT_RXOFIS
  *             - \ref UTCPD_ALERT_SKDCDTIS
  *             - \ref UTCPD_ALERT_VNDIS
  * @return     0: Successful,  1: Fail
  *
  * @details    Write One Clear
  *
  */
int32_t UTCPD_ClearAlertStatus(int port, int AlertStClr)
{
    return tcpc_update16(port, TCPC_REG_ALERT, AlertStClr, MASK_SET);
}

/**
  * @brief      Enable UTCPD Alert Mask
  *
  * @param[in]  port         Specified UTCPD port
  * @param[in]  mask_set     Alert bit mask
  *             - \ref UTCPD_ALERTM_CCSCHIE
  *             - \ref UTCPD_ALERTM_PWRSCHIE
  *             - \ref UTCPD_ALERTM_RXSOPIE
  *             - \ref UTCPD_ALERTM_RXHRSTIE
  *             - \ref UTCPD_ALERTM_TXFAILIE
  *             - \ref UTCPD_ALERTM_TXDCUIE
  *             - \ref UTCPD_ALERTM_TXSOKIE
  *             - \ref UTCPD_ALERTM_VBAMHIE
  *             - \ref UTCPD_ALERTM_VBAMLIE
  *             - \ref UTCPD_ALERTM_FUTIE
  *             - \ref UTCPD_ALERTM_RXOFIE
  *             - \ref UTCPD_ALERTM_SKDCDTIE
  *             - \ref UTCPD_ALERTM_VNDIE
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_EnableAlertMask(int port, int mask_set)
{
    return tcpc_update16(port, TCPC_REG_ALERT_MASK, mask_set, MASK_SET);
}


/**
  * @brief      Disable UTCPD Alert Mask
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  mask_clr     clear Alert bit mask
  *             - \ref UTCPD_ALERTM_CCSCHIE
  *             - \ref UTCPD_ALERTM_PWRSCHIE
  *             - \ref UTCPD_ALERTM_RXSOPIE
  *             - \ref UTCPD_ALERTM_RXHRSTIE
  *             - \ref UTCPD_ALERTM_TXFAILIE
  *             - \ref UTCPD_ALERTM_TXDCUIE
  *             - \ref UTCPD_ALERTM_TXSOKIE
  *             - \ref UTCPD_ALERTM_VBAMHIE
  *             - \ref UTCPD_ALERTM_VBAMLIE
  *             - \ref UTCPD_ALERTM_FUTIE
  *             - \ref UTCPD_ALERTM_RXOFIE
  *             - \ref UTCPD_ALERTM_SKDCDTIE
  *             - \ref UTCPD_ALERTM_VNDIE
  *
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_DisableAlertMask(int port, int mask_clr)
{
    return tcpc_update16(port, TCPC_REG_ALERT_MASK, mask_clr, MASK_CLR);
}

/**
  * @brief      Enable UTCPD Power Status Mask
  *
  * @param[in]  port         Specified UTCPD port
  * @param[in]  mask_set     Power status bit mask
  *             - \ref UTCPD_PWRSM_SKVBIE
  *             - \ref UTCPD_PWRSM_VCPSIE
  *             - \ref UTCPD_PWRSM_VBPSIE
  *             - \ref UTCPD_PWRSM_VBDTDGIE
  *             - \ref UTCPD_PWRSM_SRVBIE
  *             - \ref UTCPD_PWRSM_SRHVIE
  *             - \ref UTCPD_PWRSM_DACONIE
  *
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_EnablePowerStatusMask(int port, int mask_set)
{
    return tcpc_update16(port, TCPC_REG_POWER_STATUS_MASK, mask_set, MASK_SET);
}

/**
  * @brief      Disable UTCPD Power Status Mask
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  mask_clr     clear Power bit mask
  *             - \ref UTCPD_PWRSM_SKVBIE
  *             - \ref UTCPD_PWRSM_VCPSIE
  *             - \ref UTCPD_PWRSM_VBPSIE
  *             - \ref UTCPD_PWRSM_VBDTDGIE
  *             - \ref UTCPD_PWRSM_SRVBIE
  *             - \ref UTCPD_PWRSM_SRHVIE
  *             - \ref UTCPD_PWRSM_DACONIE
  *
  * @return     0: Successful,  1: Fail
  *
  * @details    None
    *
  */
int32_t UTCPD_DisablePowerStatusMask(int port, int mask_clr)
{
    return tcpc_update16(port, TCPC_REG_POWER_STATUS_MASK, mask_clr, MASK_CLR);
}


/**
  * @brief      Enable UTCPD Fault Status Mask
  *
  * @param[in]  port         Specified UTCPD port
  * @param[in]  mask_set     Fault Status bit mask
  *             - \ref UTCPD_FAULTSM_VCOCIE
  *             - \ref UTCPD_FAULTSM_VBOVIE
  *             - \ref UTCPD_FAULTSM_VBOCIE
  *             - \ref UTCPD_FAULTSM_FDGFALIE
  *             - \ref UTCPD_FAULTSM_ADGFALIE
  *             - \ref UTCPD_FAULTSM_FOFFVBIE
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_EnableFaultMask(int port, int mask_set)
{
    return tcpc_update16(port, TCPC_REG_FAULT_STATUS_MASK, mask_set, MASK_SET);
}

/**
  * @brief      Disable UTCPD Fault Status Mask
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  mask_clr     clear Fault Status bit mask
  *             - \ref UTCPD_FAULTSM_VCOCIE
  *             - \ref UTCPD_FAULTSM_VBOVIE
  *             - \ref UTCPD_FAULTSM_VBOCIE
  *             - \ref UTCPD_FAULTSM_FDGFALIE
  *             - \ref UTCPD_FAULTSM_ADGFALIE
  *             - \ref UTCPD_FAULTSM_FOFFVBIE
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_DisableFaultMask(int port, int mask_clr)
{
    return tcpc_update16(port, TCPC_REG_FAULT_STATUS_MASK, mask_clr, MASK_CLR);
}

/**
  * @brief      Enable UTCPD Power Control
  *
  * @param[in]  port         Specified UTCPD port
  * @param[in]  mask_set     Power Control bit mask
  *             - \ref UTCPD_PWRCTL_VCEN
  *             - \ref UTCPD_PWRCTL_VCPWR
  *             - \ref UTCPD_PWRCTL_FDGEN
  *             - \ref UTCPD_PWRCTL_BDGEN
  *             - \ref UTCPD_PWRCTL_ADGDC
  *             - \ref UTCPD_PWRCTL_DSVBAM_DIS
  *             - \ref UTCPD_PWRCTL_VBMONI_DIS
  *
  * @return     None
  *
  * @details    Remember that VBUS Monitor and VBUS Alarm are "0" enabled. And both are "1" disabled
  *
  */
int32_t UTCPD_EnablePowerCtrl(int port, uint32_t mask_set)
{
    return tcpc_update16(port, TCPC_REG_POWER_CTRL, mask_set, MASK_SET);  /* VBUS Monitor and VBUS Alarm are 0 to enable */
}

/**
  * @brief      Disable UTCPD Power Control
  *
  * @param[in]  port         Specified UTCPD port
  * @param[in]  maskclr      clear Power Control bit mask
  *             - \ref UTCPD_PWRCTL_VCEN
  *             - \ref UTCPD_PWRCTL_VCPWR
  *             - \ref UTCPD_PWRCTL_FDGEN
  *             - \ref UTCPD_PWRCTL_BDGEN
  *             - \ref UTCPD_PWRCTL_ADGDC
  *             - \ref UTCPD_PWRCTL_DSVBAM_DIS
  *             - \ref UTCPD_PWRCTL_VBMONI_DIS
  * @return     None
  *
  * @details    Remember that VBUS Monitor and VBUS Alarm are "0" enabled. And both are "1" disabled
  *
  */
int32_t UTCPD_DisablePowerCtrl(int port, uint32_t maskclr)
{
    return tcpc_update16(port, TCPC_REG_POWER_CTRL, maskclr, MASK_CLR);  /* VBUS Monitor and VBUS Alarm are 1 to disable */
}


/**
  * @brief      Enable UTCPD Fault Control
  *
  * @param[in]  port         Specified UTCPD port
  * @param[in]  mask_set     Fault bit mask
  *             - \ref UTCPD_FAULTCTL_VCOCDTDS
  *             - \ref UTCPD_FAULTCTL_VBOVDTDS
  *             - \ref UTCPD_FAULTCTL_VBOCDTDS
  *             - \ref UTCPD_FAULTCTL_VBDGTMDS
  *             - \ref UTCPD_FAULTCTL_FOFFVBDS
  *
  * @return     None
  *
  * @details    When Time-out flag will be set, use this function to clear I2C Bus Time-out counter flag .
  *
  */
int32_t UTCPD_EnableFaultCtrl(int port, uint32_t mask_set)
{
    return tcpc_update16(port, TCPC_REG_FAULT_CTRL, mask_set, MASK_CLR);  /* 0 to enable */
}

/**
  * @brief      Disable UTCPD Fault Control
  *
  * @param[in]  port         Specified UTCPD port
  * @param[in]  maskclr      clear Fault bit mask
  *             - \ref UTCPD_FAULTCTL_VCOCDTDS
  *             - \ref UTCPD_FAULTCTL_VBOVDTDS
  *             - \ref UTCPD_FAULTCTL_VBOCDTDS
  *             - \ref UTCPD_FAULTCTL_VBDGTMDS
  *             - \ref UTCPD_FAULTCTL_FOFFVBDS
  * @return     None
  *
  * @details    None
  *
  */
int32_t UTCPD_DisableFaultCtrl(int port, uint32_t maskclr)
{
    return tcpc_update16(port, TCPC_REG_FAULT_CTRL, maskclr, MASK_SET);  /* 1 to disable */
}



/**
  * @brief      Clear UTCPD Power Status
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  PowerStClr   Power status clear
  *             - \ref UTCPD_PWRSTS_SKVB
  *             - \ref UTCPD_PWRSTS_VCPS
  *             - \ref UTCPD_PWRSTS_VBPS
  *             - \ref UTCPD_PWRSTS_VBPSDTEN
  *             - \ref UTCPD_PWRSTS_SRVB
  *             - \ref UTCPD_PWRSTS_SRHV
  *             - \ref UTCPD_PWRSTS_DACON
  *
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_ClearPowerStatus(int port, int PowerStClr)
{
    return tcpc_update16(port, TCPC_REG_POWER_STATUS, PowerStClr, MASK_CLR);
}

/**
  * @brief      Enable UTCPD Fault Status Mask
  *
  * @param[in]  port         Specified UTCPD port
  * @param[in]  mask_set     Fault status bit mask
  *
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_EnableFaultStatusMask(int port, int mask_set)
{
    return tcpc_update16(port, TCPC_REG_FAULT_STATUS, mask_set, MASK_SET);
}

/**
  * @brief      Disable UTCPD Fault Status Mask
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  mask_clr     clear Fault bit mask
  *
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  */
int32_t UTCPD_DisableFaultStatusMask(int port, int mask_clr)
{
    return tcpc_update16(port, TCPC_REG_FAULT_STATUS_MASK, mask_clr, MASK_CLR);
}

/**
  * @brief      Get UTCPD Fault Status
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  pi32RegData  Fault status
  *
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_GetFaultStatus(int port, int *pi32RegData)
{
    return tcpc_addr_read16(port, 0, TCPC_REG_FAULT_STATUS, pi32RegData);
}

/**
  * @brief      Clear UTCPD Fault Status
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  FaultStClr   Fault status clear
  *
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_ClearFaultStatus(int port, int FaultStClr)
{
    return tcpc_update16(port, TCPC_REG_FAULT_STATUS, FaultStClr, MASK_CLR);
}

/**
  * @brief      Set Role Control
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  u32DrpToggle DRP toggling
  *             - \ref UTCPD_ROLECTL_DRP
  *             - \ref NULL
  * @param[in]  u32Rpvalue   Rp pull up value
  *             - \ref UTCPD_ROLECTL_RPVALUE_DEF
  *             - \ref UTCPD_ROLECTL_RPVALUE_1P5A
  *             - \ref UTCPD_ROLECTL_RPVALUE_3A
  * @param[in]  u32CC2       Force CC2 state
  *             - \ref UTCPD_ROLECTL_CC2_RA
  *             - \ref UTCPD_ROLECTL_CC2_RP
  *             - \ref UTCPD_ROLECTL_CC2_RD
  *             - \ref UTCPD_ROLECTL_CC2_OPEN
  * @param[in]  u32CC1       Force CC1 state
  *             - \ref UTCPD_ROLECTL_CC1_RA
  *             - \ref UTCPD_ROLECTL_CC1_RP
  *             - \ref UTCPD_ROLECTL_CC1_RD
  *             - \ref UTCPD_ROLECTL_CC1_OPEN
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_SetRoleCtrl(int port, uint32_t u32DrpToggle, uint32_t u32Rpvalue, uint32_t u32CC2, uint32_t u32CC1)
{
    uint32_t reg_set = u32DrpToggle | u32Rpvalue | u32CC2 | u32CC1;
    return tcpc_addr_write16(port, 0, TCPC_REG_ROLE_CTRL, reg_set);
}

/**
  * @brief      Get Role Control
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  pu32DrpToggle DRP toggling or not
  * @param[in]  pu32CC1       Force CC1 state
  *             - \ref UTCPD_ROLECTL_CC1_RA
  *             - \ref UTCPD_ROLECTL_CC1_RP
  *             - \ref UTCPD_ROLECTL_CC1_RD
  *             - \ref UTCPD_ROLECTL_CC1_OPEN
  * @param[in]  pu32CC2       Force CC2 state
  *             - \ref UTCPD_ROLECTL_CC2_RA
  *             - \ref UTCPD_ROLECTL_CC2_RP
  *             - \ref UTCPD_ROLECTL_CC2_RD
  *             - \ref UTCPD_ROLECTL_CC2_OPEN
  * @param[in]  pu32Rpvalue   Rp pull up value
  *             - \ref UTCPD_ROLECTL_RPVALUE_DEF
  *             - \ref UTCPD_ROLECTL_RPVALUE_1P5A
  *             - \ref UTCPD_ROLECTL_RPVALUE_3A
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  */
int32_t UTCPD_GetRoleCtrl(int port, uint32_t *pu32DrpToggle, uint32_t *pu32CC1, uint32_t *pu32CC2, uint32_t *pu32Rpvalue)
{
    uint32_t u32Reg;
    int32_t rv;

    rv = tcpc_addr_read32(port, 0, TCPC_REG_ROLE_CTRL, (int *)&u32Reg);
    *pu32DrpToggle = u32Reg & UTCPD_ROLCTL_DRP_Msk;
    *pu32Rpvalue = u32Reg & UTCPD_ROLCTL_RPVALUE_Msk;
    *pu32CC2 = u32Reg & UTCPD_ROLCTL_CC2_Msk;
    *pu32CC1 = u32Reg & UTCPD_ROLCTL_CC1_Msk;
    return rv;
}

/**
  * @brief      Set Type-C Port Control
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  u32BistMode  Enable or Disable BIST Mode
  * @param[in]  u32Orient    Plug Oritentation
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_SetTypeCPortCtrl(int port, uint32_t u32BistMode, uint32_t u32Orient)
{
    uint32_t reg_set = u32BistMode | u32Orient;
    return tcpc_addr_write16(port, 0, TCPC_REG_TCPC_CTRL, reg_set);
}


/**
  * @brief      Get Type-C Port Control
  *
  * @param[in]  port          Specify UTCPD port
  * @param[in]  pu32BistMode  Enable or Disable BIST Mode
  * @param[in]  pu32Orient    Plug Oritentation
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  */
int32_t UTCPD_GetTypeCPortCtrl(int port, uint32_t *pu32BistMode, uint32_t *pu32Orient)
{
    uint32_t u32Reg;
    int32_t rv;

