OpenNuvoton/M55M1BSP/Library/StdDriver/src/utcpd.c
    rv = tcpc_addr_read32(port, 0, TCPC_REG_TCPC_CTRL, (int *)&u32Reg);
    *pu32BistMode = u32Reg & UTCPD_TCPCCTL_BISTEN;
    *pu32Orient = u32Reg & UTCPD_TCPCCTL_ORIENT;
    return rv;
}

/**
  * @brief      UTCPD Issue Command
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  cmd          Type-C Port Control
  *             - \ref UTCPD_CMD_DISABLE_VBUS_DETECT
  *             - \ref UTCPD_CMD_ENABLE_VBUS_DETECT
  *             - \ref UTCPD_CMD_DISABLE_SINK_VBUS
  *             - \ref UTCPD_CMD_SINK_VBUS
  *             - \ref UTCPD_CMD_SRC_VBUS_DEFAULT
  *             - \ref UTCPD_CMD_SRC_VBUS_NONDEFAULT
  *             - \ref UTCPD_CMD_LOOK4CONNECTION
  * @return     0: Successful,  1: Fail
  *
  * @details    The command can't be read back.
  *
  */
int32_t UTCPD_IsssueCmd(int port, uint32_t cmd)
{
    return tcpc_addr_write16(port, 0, TCPC_REG_COMMAND, cmd);
}



/**
  * @brief      Get CC Status
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  pu32Look4Con              Under Look for connection or done
  *             - \ref UTCPD_LK4CONN_DONE
  *             - \ref UTCPD_UNDER_LK4CONN
  * @param[in]  pu32ConRlt                Connection result
  *             - \ref UTCPD_CONN_RESULT_RP
  *             - \ref UTCPD_CONN_RESULT_RD
  * @param[in]  pu32CC2Sts    The is CC2_State.  CC2 connection state depends on connection result
  *              - \ref UTCPD_CCSTS_CC2STATE_SRC_OPEN
  *              - \ref UTCPD_CCSTS_CC2STATE_SRC_RA
  *              - \ref UTCPD_CCSTS_CC2STATE_SRC_RD
  *              - \ref UTCPD_CCSTS_CC2STATE_SNK_OPEN
  *              - \ref UTCPD_CCSTS_CC2STATE_SNK_DEF
  *              - \ref UTCPD_CCSTS_CC2STATE_SNK_1P5A
  *              - \ref UTCPD_CCSTS_CC2STATE_SNK_3A
  * @param[in]  pu32CC1Sts is CC1_State.   CC1 connection state depends on connection result
  *             - \ref UTCPD_CCSTS_CC1STATE_SRC_OPEN
  *             - \ref UTCPD_CCSTS_CC1STATE_SRC_RA
  *             - \ref UTCPD_CCSTS_CC1STATE_SRC_RD
  *             - \ref UTCPD_CCSTS_CC1STATE_SNK_OPEN
  *             - \ref UTCPD_CCSTS_CC1STATE_SNK_DEF
  *             - \ref UTCPD_CCSTS_CC1STATE_SNK_1P5A
  *             - \ref UTCPD_CCSTS_CC1STATE_SNK_3A
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  */
int32_t UTCPD_GetCCSts(int port, uint32_t *pu32Look4Con, uint32_t *pu32ConRlt, uint32_t *pu32CC2Sts, uint32_t *pu32CC1Sts)
{
    uint32_t u32Reg;
    int32_t rv;

    rv = tcpc_addr_read32(port, 0, TCPC_REG_CC_STATUS, (int *)&u32Reg);
    *pu32Look4Con = (u32Reg & TCPC_REG_CC_STATUS_LOOK4CONNECTION_MASK);
    *pu32ConRlt = (u32Reg & TCPC_REG_CC_STATUS_CONNECT_RESULT_MASK);
    *pu32CC2Sts = (u32Reg & TCPC_REG_CC_STATUS_CC2_STATE_MASK);
    *pu32CC1Sts = (u32Reg & TCPC_REG_CC_STATUS_CC1_STATE_MASK);
    return rv;
}


/**
  * @brief      Get Power Status
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  pu32VBUSDetEn         VBUS Present Detection Enabled or not
  * @param[in]  pu32VBUSPresent       VBUS Present or not
  * @param[in]  pu32VCONNPresent      VCONN Present or not
  * @param[in]  pu32SnkVBUS           Sinking VBUS or not
* @return     0: Successful,  1: Fail
  *
  * @details    None
  */
int32_t UTCPD_GetPwrSts(int port, uint32_t *pu32VBUSDetEn, uint32_t *pu32VBUSPresent, uint32_t *pu32VCONNPresent, uint32_t *pu32SnkVBUS)
{
    uint32_t u32Reg;
    int32_t rv;

    rv = tcpc_addr_read32(port, 0, TCPC_REG_POWER_STATUS, (int *)&u32Reg);
    *pu32VBUSDetEn = u32Reg & UTCPD_PWRSTS_VBPSDTEN_Msk;
    *pu32VBUSPresent = u32Reg & UTCPD_PWRSTS_VBPS_Msk;
    *pu32VCONNPresent = u32Reg & UTCPD_PWRSTS_VCPS_Msk;
    *pu32SnkVBUS = u32Reg & UTCPD_PWRSTS_SKVB_Msk;
    return rv;
}

/**
  * @brief      Get Power Status Extention
  *
  * @param[in]  port                      Specify UTCPD port
  * @param[in]  pu32DbgAccessory          Debug Accessory Mode or not
  * @param[in]  pu32SrcNonDefVBUS         Source Non-Default VBUS or not
  * @param[in]  pu32SrcDefVBUS            Source Default VBUS or not
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  */
int32_t UTCPD_GetPwrStsExt(int port, uint32_t *pu32DbgAccessory, uint32_t *pu32SrcNonDefVBUS, uint32_t *pu32SrcDefVBUS)
{
    uint32_t u32Reg;
    int32_t rv;

    rv = tcpc_addr_read32(port, 0, TCPC_REG_POWER_STATUS, (int *)&u32Reg);
    *pu32DbgAccessory = u32Reg & UTCPD_PWRSTS_DACON_Msk;
    *pu32SrcNonDefVBUS = u32Reg & UTCPD_PWRSTS_SRHV_Msk;
    *pu32SrcDefVBUS = u32Reg & UTCPD_PWRSTS_SRVB_Msk;
    return rv;
}

/**
  * @brief      Get Power Status
  *
  * @param[in]  port                Specify UTCPD port
  * @param[in]  pu32VBUSOverCurr         VBUS Over Current Fault or not
  * @param[in]  pu32VBUSOverVolt         VBUS Over Voltage Fault or not
  * @param[in]  pu32VCONNOverCurr        VCONN Over Current  Fault or not
  * @param[in]  pu32I2CInfErr            I2C Interface Error(Not support)
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  */
int32_t UTCPD_GetFaultSts(int port, uint32_t *pu32VBUSOverCurr, uint32_t *pu32VBUSOverVolt, uint32_t *pu32VCONNOverCurr, uint32_t *pu32I2CInfErr)
{
    uint32_t u32Reg;
    int32_t rv;

    rv = tcpc_addr_read32(port, 0, TCPC_REG_FAULT_STATUS, (int *)&u32Reg);
    *pu32VBUSOverCurr = u32Reg & UTCPD_FUTSTS_VBOCFUT_Msk;
    *pu32VBUSOverVolt = u32Reg & UTCPD_FUTSTS_VBOVFUT_Msk;
    *pu32VCONNOverCurr = u32Reg & UTCPD_FUTSTS_VCOCFUT_Msk;
    *pu32I2CInfErr = 0;  /* M55M1 didn't support I2C */
    return rv;
}


/**
  * @brief      Get Fault Status Extention
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  pu32ForceOffFat         Force Off VBUS Fault
  * @param[in]  pu32AutoDiscFat         Auto Discharge Fault
  * @param[in]  pu32ForceDiscFat        Foece Discharge Fault
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  */
int32_t UTCPD_GetFaultStsExt(int port, uint32_t *pu32ForceOffFat, uint32_t *pu32AutoDiscFat, uint32_t *pu32ForceDiscFat)
{
    uint32_t u32Reg;
    int32_t rv;

    rv = tcpc_addr_read32(port, 0, TCPC_REG_FAULT_STATUS, (int *)&u32Reg);
    *pu32ForceOffFat = u32Reg & UTCPD_FUTSTS_FOFFVB_Msk;
    *pu32AutoDiscFat = u32Reg & UTCPD_FUTSTS_ADGFAL_Msk;
    *pu32ForceDiscFat = u32Reg & UTCPD_FUTSTS_FDGFAL_Msk;
    return rv;
}


/**
  * @brief      Set Message Header Information
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  u32DataRole  Data Role
  *             - \ref UTCPD_MHINFO_DROLE_UFP
  *             - \ref UTCPD_MHINFO_DROLE_DFP
  * @param[in]  u32Revision  PD Revision
  *             - \ref UTCPD_MHINFO_PDREV_10
  *             - \ref UTCPD_MHINFO_PDREV_20
  *             - \ref UTCPD_MHINFO_PDREV_30
  *             - \ref UTCPD_MHINFO_PDREV_31
  * @param[in]  u32PwrRole  Power Role
  *             - \ref UTCPD_MHINFO_PROLE_SNK
  *             - \ref UTCPD_MHINFO_PROLE_SRC
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_SetMsgHeaderInfo(int port, uint32_t u32DataRole, uint32_t u32Revision, uint32_t u32PwrRole)
{
    uint32_t reg_set = u32DataRole | u32Revision | u32PwrRole;
    return tcpc_addr_write16(port, 0, TCPC_REG_MSG_HDR_INFO, reg_set);
}

/**
  * @brief      Set Message Header Information
  *
  * @param[in]  port         Specify UTCPD port
  * @param[in]  u32RegData   Combination from following set
  *             - \ref UTCPD_RDET_SOPEN
  *             - \ref UTCPD_RDET_SOPPEN
  *             - \ref UTCPD_RDET_SOPPPEN
  *             - \ref UTCPD_RDET_SDBGPEN
  *             - \ref UTCPD_RDET_SDBGPEN
  *             - \ref UTCPD_RDET_SDBGPPEN
  *             - \ref UTCPD_RDET_HRSTEN
  *             - \ref UTCPD_RDET_CABRSTEN
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_SetRecDetect(int port, uint32_t u32RegData)
{
    uint32_t reg_set = u32RegData;
    return tcpc_addr_write16(port, 0, TCPC_REG_RX_DETECT, reg_set);
}

/**
  * @brief      Set VBUS Alarm High and Alarm Low Voltage
  *
  * @param[in]  port             Specify UTCPD port
  * @param[in]  u32AlarmH        VBUS Alarm High Threshold Voltage
  * @param[in]  u32AlarmL        VBUS Alarm Low Threshold Voltage
  * @return     0: Successful,  1: Fail
  *
  * @details    None
  *
  */
int32_t UTCPD_SetVBUSAlarm(int port, uint32_t u32AlarmH, uint32_t u32AlarmL)
{
    uint8_t u8TxBuf[4];
    u8TxBuf[0] = u32AlarmH;
    u8TxBuf[1] = u32AlarmH >> 8;
    u8TxBuf[2] = u32AlarmL;
    u8TxBuf[3] = u32AlarmL >> 8;
    return tcpc_write_block(port, TCPC_REG_VBUS_VOLTAGE_ALARM_HI_CFG, u8TxBuf, 4);
}

/**
  * @brief      Set Sink Disconnection Voltage
  *
  * @param[in]  port             Specify UTCPD port
  * @param[in]  u32SnkDiscVolt   Sink Disconnection Threshold Voltae
  * @return     0: Successful,  1: Fail
  *
  * @details    Sink Will start the VBUS auto discharge if VBUS voltage less Sink Disconnection Threshold Level
  *             POWER_CONTROL[Auto Discharge] should set to 1.
  *
  */
int32_t UTCPD_SetSnkDisconnect(int port, uint32_t u32SnkDiscVolt)
{
    return tcpc_addr_write16(port, 0, TCPC_REG_VBUS_SINK_DISCONNECT_THRESH, u32SnkDiscVolt);
}

/**
  * @brief      Set VBUS Stop Discharge Threshold Voltage
  *
  * @param[in]  port                Specify UTCPD port
  * @param[in]  u32StopDischgVolt   VBUS Stop Discharge Threshold Voltage
  * @return     0: Successful,  1: Fail
  *
  * @details    SRC/SNK Will stop VBUS force discharge if VBUS voltage less VBUS Stop Discharge Threshold Level
  *             POWER_CONTROL[Force Discharge] should set to 1.
  *
  */
int32_t UTCPD_SetStopDischargeVolt(int port, uint32_t u32StopDischgVolt)
{
    return tcpc_addr_write16(port, 0, TCPC_REG_VBUS_STOP_DISCHARGE_THRESH, u32StopDischgVolt);
}


