OpenNuvoton/M55M1BSP/Library/StdDriver/src/utcpd.c
/*
    The CC ststus interupt won't be issued if Enable_VCONN_SRC_CC with wrong VCONN source CC pin
*/
/**
  * @brief      Disable VCONN Power Source to CCx pin
  *
  * @param[in]  port                Specify UTCPD port
  * @return     None
  *
  * @details    None
  *
  */
void UTCPD_vconn_disable_src_cc(int port)
{
    (void)tcpc_update16(port, TCPC_REG_POWER_CTRL, TCPC_REG_POWER_CTRL_ENABLE_VCONN, MASK_CLR);
}

/**
  * @brief      Enable VCONN Power Source to CCx pin
  *
  * @param[in]  port                Specify UTCPD port
  * @return     None
  *
  * @details    None
  *
  */
void UTCPD_vconn_enable_src_cc(int port)
{
    (void)tcpc_update16(port, TCPC_REG_POWER_CTRL, TCPC_REG_POWER_CTRL_ENABLE_VCONN, MASK_SET);
}

/**
  * @brief      VCONN Power Source to CC2 pin
  *
  * @param[in]  port                Specify UTCPD port
  * @return     None
  *
  * @details    Enable VCONN Source CC2, Communication channel through CC1
  *
  */
void UTCPD_vconn_enable_from_cc2(int port)
{
    (void)tcpc_update16(port, TCPC_REG_TCPC_CTRL, TCPC_REG_TCPC_CTRL_PLUG_ORIENTATION, MASK_CLR);
}

/**
  * @brief      VCONN Power Source to CC1 pin
  *
  * @param[in]  port                Specify UTCPD port
  * @return     None
  *
  * @details    Enable VCONN Source CC1, Communication channel through CC2
  *
  */
void UTCPD_vconn_enable_from_cc1(int port)
{
    (void)tcpc_update16(port, TCPC_REG_TCPC_CTRL, TCPC_REG_TCPC_CTRL_PLUG_ORIENTATION, MASK_SET);
}

/**
  * @brief      Set VCONN Active Polarity Low
  *
  * @param[in]  port                Specify UTCPD port
  * @return     None
  *
  * @details    It depends on the external circuit
  *
  */
void UTCPD_vconn_polarity_active_low(int port)
{
    (void)tcpc_update16(port, TCPC_REG_PINPL, TCPC_REG_PINPL_VCEN, MASK_CLR);
}

/**
  * @brief      Set VCONN Active Polarity High
  *
  * @param[in]  port                Specify UTCPD port
  * @return     None
  *
  * @details    It depends on the external circuit
  *
  */
void UTCPD_vconn_polarity_active_high(int port)
{
    /* Set VCONN Polarity Active Low due to CC1VCENS and CC2VCENS default high */
    (void)tcpc_update16(port, TCPC_REG_PINPL, TCPC_REG_PINPL_VCEN, MASK_SET);
}

/**
  * @brief      Disable VCONN OC Fault
  *
  * @param[in]  port                Specify UTCPD port
  * @return     None
  *
  * @details
  *
  */
void UTCPD_vconn_disable_oc_fault(int port)
{
    (void)tcpc_update16(port, TCPC_REG_FAULT_CTRL, TCPC_REG_FAULT_CTRL_VCONN_OCP_FAULT_DIS, MASK_SET);
}

/**
  * @brief      Enable VCONN OC Fault
  *
  * @param[in]  port                Specify UTCPD port
  * @return     None
  *
  * @details
  *
  */
void UTCPD_vconn_enable_oc_fault(int port)
{
    (void)tcpc_update16(port, TCPC_REG_FAULT_CTRL, TCPC_REG_FAULT_CTRL_VCONN_OCP_FAULT_DIS, MASK_CLR);
}

/**
  * @brief      Specified VCONN Enable Multiplex Path
  *
  * @param[in]  port                Specify UTCPD port
  * @param[in]  cc1vcensel          It should be 1 default
  * @param[in]  cc2vcensel          It should be 1 default
  *
  * @details
  *
  */
void UTCPD_vconn_mux_selection(int port, uint32_t cc1vcensel, uint32_t cc2vcensel)
{
    uint32_t data;
    (void)tcpc_addr_read16(port, 0, UTCPD_MUXSEL, (int *)&data);
    data = (data & ~(CC2VCENS | CC1VCENS)) | ((cc1vcensel << 24) | (cc2vcensel << 28));
    (void)tcpc_addr_write32(port, 0, UTCPD_MUXSEL, (int)data);
}

/**
  * @brief      Configure VCONN OC source detection
  *
  * @param[in]  port                Specify UTCPD port
  * @param[in]  u32Src              Specify VCONN OC Source Detection
  *             - \ref UTCPD_VCONN_OC_EINT0
  *             - \ref UTCPD_VCONN_OC_EINT1
  *             - \ref UTCPD_VCONN_OC_EINT2
  *             - \ref UTCPD_VCONN_OC_EINT3
  *             - \ref UTCPD_VCONN_OC_ADC_CMP1
  *             - \ref UTCPD_VCONN_OC_ACMP0
  *             - \ref UTCPD_VCONN_OC_ACMP1
  *             - \ref UTCPD_VCONN_OC_ACMP2
  * @details
  *
  */
void UTCPD_vconn_configure_oc_detection_soruce(int port, uint32_t u32Src)
{
    uint32_t data;
    (void)tcpc_addr_read16(port, 0, UTCPD_MUXSEL, (int *)&data);
    data = (data & ~VCOCS) | (u32Src << 4);
    (void)tcpc_addr_write16(port, 0, UTCPD_MUXSEL, (int)data);
}

/* ============  VBUS SRCEN Polarity ==========*/
void UTCPD_vbus_srcen_polarity_active_low(int port)
{
    /* Set VBUS SRCEN Polarity active Low */
    (void)tcpc_update16(port, TCPC_REG_PINPL, TCPC_REG_PINPL_SRCEN, MASK_CLR);
}

void UTCPD_vbus_srcen_polarity_active_high(int port)
{
    /* Set VBUS SRCEN Polarity Active high */
    (void)tcpc_update16(port, TCPC_REG_PINPL, TCPC_REG_PINPL_SRCEN, MASK_SET);
}

/* ============  VBUS SNKEN Polarity ==========*/
void UTCPD_vbus_snken_polarity_active_low(int port)
{
    /* Set VBUS SNKEN Polarity active Low */
    (void)tcpc_update16(port, TCPC_REG_PINPL, TCPC_REG_PINPL_SNKEN, MASK_CLR);
}

void UTCPD_vbus_snken_polarity_active_high(int port)
{
    /* Set VBUS SNKEN Polarity Active high */
    (void)tcpc_update16(port, TCPC_REG_PINPL, TCPC_REG_PINPL_SNKEN, MASK_SET);
}

void UTCPD_vbus_disable_oc_fault(int port)
{
    (void)tcpc_update16(port, TCPC_REG_FAULT_CTRL, TCPC_REG_FAULT_CTRL_VBUS_OCP_FAULT_DIS, MASK_SET);
}

void UTCPD_vbus_enable_oc_fault(int port)
{
    (void)tcpc_update16(port, TCPC_REG_FAULT_CTRL, TCPC_REG_FAULT_CTRL_VBUS_OCP_FAULT_DIS, MASK_CLR);
}

void UTCPD_vbus_discharge_polarity_active_low(int port)
{
    /* Set VBUS discharge Polarity Active low */
    (void)tcpc_update16(port, TCPC_REG_PINPL, TCPC_REG_PINPL_VBDCHG, MASK_CLR);
}

void UTCPD_vbus_discharge_polarity_active_high(int port)
{
    /* Set VBUS discharge Polarity Active high */
    (void)tcpc_update16(port, TCPC_REG_PINPL, TCPC_REG_PINPL_VBDCHG, MASK_SET);
}

/**
  * @brief      Configure VBUS OC source detection
  *
  * @param[in]  port                Specify UTCPD port
  * @param[in]  u32Src              Specify VBUS OC Source Detection
  *             - \ref UTCPD_VBUS_OC_EINT0
  *             - \ref UTCPD_VBUS_OC_EINT1
  *             - \ref UTCPD_VBUS_OC_EINT2
  *             - \ref UTCPD_VBUS_OC_EINT3
  *             - \ref UTCPD_VBUS_OC_ADC_CMP0
  *             - \ref UTCPD_VBUS_OC_ACMP0
  *             - \ref UTCPD_VBUS_OC_ACMP1
  *             - \ref UTCPD_VBUS_OC_ACMP2
  * @details
  *
  */
void UTCPD_vbus_configure_oc_soruce(int port, uint32_t u32Src)
{
    uint32_t data;
    (void)tcpc_addr_read16(port, 0, UTCPD_MUXSEL, (int *)&data);
    data = (data & ~VBOCS) | (u32Src << 0);
    (void)tcpc_addr_write16(port, 0, UTCPD_MUXSEL, (int)data);
}

/* VBUS ovp fault */
void UTCPD_vbus_disable_ov_fault(int port)
{
    (void)tcpc_update16(port, TCPC_REG_FAULT_CTRL, TCPC_REG_FAULT_CTRL_VBUS_OVP_FAULT_DIS, MASK_SET);
}

