OpenNuvoton/M55M1BSP/Library/StdDriver/src/utcpd.c
void UTCPD_vbus_enable_ov_fault(int port)
{
    (void)tcpc_update16(port, TCPC_REG_FAULT_CTRL, TCPC_REG_FAULT_CTRL_VBUS_OVP_FAULT_DIS, MASK_CLR);
}

/* VBUS force off fault */
void UTCPD_vbus_disable_forceoff_fault(int port)
{
    (void)tcpc_update16(port, TCPC_REG_FAULT_CTRL, TCPC_REG_FAULT_CTRL_VBUS_FORCE_OFF_DIS, MASK_SET);
}

void UTCPD_vbus_enable_forceoff_fault(int port)
{
    (void)tcpc_update16(port, TCPC_REG_FAULT_CTRL, TCPC_REG_FAULT_CTRL_VBUS_FORCE_OFF_DIS, MASK_CLR);
}


uint32_t UTCPD_vbus_is_source(int port)
{
    uint32_t data;
    (void)tcpc_addr_read16(port, 0, TCPC_REG_POWER_STATUS, (int *)&data);

    if (data & TCPC_REG_POWER_STATUS_SOURCING_VBUS)
    {
        return 1;
    }
    else
    {
        return 0;
    }
}

uint32_t UTCPD_vbus_is_sink(int port)
{
    uint32_t data;
    (void)tcpc_addr_read16(port, 0, TCPC_REG_POWER_STATUS, (int *)&data);

    if (data & TCPC_REG_POWER_STATUS_SINKING_VBUS)
    {
        return 1;
    }
    else
    {
        return 0;
    }
}

uint32_t UTCPD_vbus_is_source_hv(int port)
{
    uint32_t data;
    (void)tcpc_addr_read16(port, 0, TCPC_REG_POWER_STATUS, (int *)&data);

    if (data & TCPC_REG_POWER_STATUS_SOURCING_HIGH_VBUS)
    {
        return 1;
    }
    else
    {
        return 0;
    }
}

//=================================== for VBUS and VCONN
void UTCPD_power_enable_monitor(int port)
{
    /* 0 enable monitor */
    (void)tcpc_update16(port, TCPC_REG_POWER_CTRL, TCPC_REG_POWER_CTRL_VBUS_VOL_MONITOR_DIS, MASK_CLR);
}

void UTCPD_power_disable_monitor(int port)
{
    /* 1 disable monitor */
    (void)tcpc_update16(port, TCPC_REG_POWER_CTRL, TCPC_REG_POWER_CTRL_VBUS_VOL_MONITOR_DIS, MASK_SET);
}

/* VBUS enable auto discharge */
void UTCPD_power_disable_auto_discharge(int port)
{
    /* Disable Auto Discharge = 0 */
    (void)tcpc_update16(port, TCPC_REG_POWER_CTRL, TCPC_REG_POWER_CTRL_AUTO_DISCHARGE_DISCONNECT, MASK_CLR);
}

void UTCPD_power_enable_auto_discharge(int port)
{
    /* Enable Auto Discharge = 0 */
    (void)tcpc_update16(port, TCPC_REG_POWER_CTRL, TCPC_REG_POWER_CTRL_AUTO_DISCHARGE_DISCONNECT, MASK_SET);
}

void UTCPD_frs_tx_polarity_active_low(int port)
{
    /* Set FRS Polarity Active low */
    (void)tcpc_update16(port, TCPC_REG_PINPL, TCPC_REG_PINPL_FRSTX, MASK_CLR);
}

void UTCPD_frs_tx_polarity_active_high(int port)
{
    /* Set FRS Polarity Active high */
    (void)tcpc_update16(port, TCPC_REG_PINPL, TCPC_REG_PINPL_FRSTX, MASK_SET);
}

void UTCPD_frs_mux_selection(int port, uint32_t cc1frssel, uint32_t cc2frssel)
{
    uint32_t data;
    (void)tcpc_addr_read16(port, 0, UTCPD_MUXSEL, (int *)&data);
    data = (data & ~(CC2FRSS | CC1FRSS)) | ((cc1frssel << 25) | (cc2frssel << 29));
    (void)tcpc_addr_write32(port, 0, UTCPD_MUXSEL, (int)data);
}

/**
  * @brief      Enable specify UTCPD Controller and set Clock Divider
  *
  * @param[in]  port         Specify UTCPD port
  * @return     Always 0
  *
  * @details    The function needs to enable the I2C Controller and set proper clock divider first.
  *
  */
uint32_t UTCPD_Open(int port)
{
    /* Enable Clock */
    /* Set Clock Divider */

    /* Unlock protected registers */
    SYS_UnlockReg();
    /* Reset UTCPD  */
    SYS_ResetModule(SYS_UTCPD0RST);


    outp32((uint32_t)UTCPD0_BASE + 0x308UL, 0xA5);
    // UTCPD trim value, if romap has , you can't write this code.
    outp32((uint32_t)UTCPD0_BASE + 0x118UL, 0x82648423UL);

    /* Set SYS_UTCPDCTL IO as CCx and CCDBx function */
    SYS->UTCPDCTL &= ~(SYS_UTCPDCTL_IOMODE_Msk);
    /* Enable UTCPD0 PHY */
    SYS->UTCPDCTL |= SYS_UTCPDCTL_POREN0_Msk;
    (void)tcpc_addr_write16(port, 0, UTCPD_PHYCTL, 0x03);


    outp32((uint32_t)UTCPD0_BASE + 0x308UL, 0);
    UTCPD_frs_mux_selection(port, 1, 1);
    UTCPD_vconn_mux_selection(port, 1, 1);
    UTCPD->IE = 0xfffUL; /* enable interrupt */

    return 0;
}


/** @} end of group UTCPD_EXPORTED_FUNCTIONS */

/** @} end of group UTCPD_Driver */

/** @} end of group Standard_Driver */

#ifdef __cplusplus
}

#endif

/*** (C) COPYRIGHT 2023 Nuvoton Technology Corp. ***/
